<template>
  <div class="wrapper">
    <p class="root_text">이용약관</p>
    <p class="header_text">제1조 (목적)</p>
    <p class="content_text">
      1. 엄태호 서비스 이용약관은 본 이용약관 ‘서비스’에 추후 추가될 수 있는
      별도의 약관들을 모두 포함한 ‘서비스’에 대한 전체 약관을 말하며, 이하
      ‘약관’이라 합니다.
    </p>
    <p class="content_text">
      2. 엄태호 이용약관은 약관에 따라 이용계약을 체결한 이용자(이하, 해당
      계약을 ‘이용계약’, 해당 이용자를 ‘회원’이라 함)가 이용함에 있어 ‘회사’와
      ‘회원’과의 법률관계를 명확히 함을 그 목적으로 합니다.
    </p>
    <p class="content_text">
      3. ‘회사’는 ‘약관’ 및 개인정보처리방침을 ‘회원’이 쉽게 확인할 수 있도록
      ‘서비스’의 초기화면 등에 게시합니다.
    </p>
    <p class="header_text">제2조 ("엄태호 계정” 생성 및 이용)</p>
    <p class="content_text">
      1. “엄태호 계정”이란 ‘회사’가 제공하는 ‘서비스’를 사용하기 위해서,
      ‘회원’이 생성한 로그인 계정을 의미합니다. “엄태호 계정”은 ‘회원’이
      ‘약관’에 동의하고, 계정 정보를 입력하시면, ‘회사’가 일정 정보를
      인증(이메일 주소 확인)한 후 가입을 인증하는 절차로 생성됩니다.
    </p>
    <p class="content_text">
      2. ‘회사’가 제공하는 ‘서비스’를 원활히 이용하기 위해서는 “엄태호 계정”이
      필요합니다.
    </p>
    <p class="content_text">
      3. “엄태호 계정”을 생성한 이후에는 ‘회사’가 제공하는 “엄태호 계정” 연동
      서비스 전체를 이용하실 수 있습니다. 다만, ‘회사’의 신규 서비스에 최초
      로그인 시 사용 동의 및 개별 서비스 이용약관에 대한 동의 등의 절차를
      진행합니다.
    </p>
    <p class="header_text">제3조 (이용계약의 체결)</p>
    <p class="content_text">
      1. ‘이용계약’은 ‘회원’이 되고자 하는 자(이하, ‘가입신청자’라 함)가
      ‘약관’의 내용에 대하여 동의를 한 다음 회원가입신청을 하고, ‘회사’가 이러한
      신청에 대하여 승낙함으로써 체결되며, ‘가입신청자’는 ‘회사’의 승낙에 따라
      ‘이용계약’이 체결되는 시점부터 ‘회원’이 되어 ‘약관’에 따라 ‘서비스’를
      이용할 수 있습니다.
    </p>
    <p class="content_text">
      2. ‘회사’는 ‘이용계약’ 체결 과정에서 ‘가입신청자’의 이메일 주소 등의
      (개인)정보를 수집할 수 있으며, 이 경우 ‘가입신청자’는 정확한(거짓이 아닌)
      정보를 제공하여야 합니다. 본 항에 따른 개인정보의 수집 및 이용과 보관 등에
      대해서는 별도로 게시되는 개인정보처리방침이 적용됩니다.
    </p>
    <p class="content_text">
      3. ‘회사’는 ‘가입신청자’의 회원가입신청에 ‘서비스’ 시스템에의 기계적 접근
      또는 계정도용, 거짓된 정보의 제공 및 ‘가입신청자’의 ‘서비스’ 어뷰징 내역
      확인 등의 사유가 있어 ‘회사’가 ‘가입신청자’의 신청을 승낙하는 것이
      적절하지 않은 경우 그 승낙을 유보 또는 거부하거나, 사후에 이용계약을
      해지할 수 있습니다.
    </p>
    <p class="content_text">
      4. ‘회사'는 아동(내국인의 경우 만14세 미만, 외국인의 경우 만16세 미만)을
      대상으로 ‘서비스’를 제공하지 않습니다.
    </p>
    <p class="header_text">제4조 (약관의 개정)</p>
    <p class="content_text">
      1. ‘회사’는 관련법령에 위배되지 않는 범위에서 ‘약관’을 개정할 수 있습니다.
    </p>
    <p class="content_text">
      2. ‘회사’는 전 항에 따라 ‘약관’을 개정할 경우, 적용일자와 변경내용 및
      사유를 명시하여 ‘서비스’를 통해 사전 공지합니다. 다만, 그 변경내용이
      법적으로 ‘회원’에게 불리한 것일 경우, 그 적용일자 30일 이전부터 변경내용을
      ‘서비스’를 통해 공지할 뿐만 아니라, 해당 내용을 ‘회원’의 이메일, 로그인 시
      동의창 등의 전자적 수단을 통해 명확히 통지합니다.
    </p>
    <p class="content_text">
      3. ‘회원’은 변경되는 약관에 동의하지 않을 경우 ‘약관’을 통해 체결되었던
      ‘서비스’에 대한 이용계약을 해지하고 ‘서비스’의 이용을 중단할 수 있습니다.
    </p>
    <p class="content_text">
      4. ‘회사’가 본 조 제2항에 따라 약관의 개정을 공지 또는 통지하면서 적용일자
      이전에 거부 의사를 표시하지 않으면 개정 약관에 동의한 것으로 본다는 뜻을
      함께 공지 또는 통지하였음에도 불구하고 ‘회원’이 명시적으로 거절의
      의사표시를 하지 않은 경우에는 ‘회원’이 개정 약관에 동의한 것으로 봅니다.
    </p>
    <p class="header_text">제5조 (서비스의 변경 및 중단 등)</p>
    <p class="content_text">
      1. ‘회사’는 필요한 경우 ‘서비스’의 내용을 변경할 수 있습니다. 다만,
      ‘서비스’ 내용의 변경이 ‘회원’의 권리와 의무에 중대한 영향을 미치는
      경우에는 제4조에 따른 공지 및 통지의 절차를 거쳐 변경합니다.
    </p>
    <p class="content_text">
      2. ‘회사’는 정보통신설비의 보수점검, 교체 및 고장, 통신두절 또는 운영상
      상당한 이유가 있는 경우 ‘서비스’의 제공을 일시적으로 중단할 수 있습니다.
    </p>
    <p class="content_text">
      3. ‘회사’는 ‘서비스’의 제공에 필요한 경우 정기점검을 실시할 수 있으며,
      정기점검이 실시되는 과정에서 ‘서비스’의 제공을 일시적으로 중단할 수
      있습니다.
    </p>
    <p class="content_text">
      4. ‘회사’는 ‘회사’의 경영상의 이유 등의 사유로 ‘서비스’를 중단할 수
      있습니다.
    </p>
    <p class="header_text">제6조 (광고의 게재)</p>
    <p>‘회사’는 ‘서비스’에 ‘회사’ 또는 제3자의 광고를 게재할 수 있습니다.</p>
    <p class="header_text">제7조 (회원의 권리 및 의무)</p>
    <p class="content_text">
      1. ‘회원’은 ‘서비스’를 통해 ‘회원’에게 제공되는 Diary, Direct Message,
      Palylist, 등의 콘텐츠(이하 ‘콘텐츠’라 함)를 개인적, 비영리적으로 열람하고
      ‘회사’가 ‘서비스’를 통해 허용하는 행위(예를 들면 direct Message에 참여하여
      메세지를 작성하는 행위 등)를 할 수 있습니다.
    </p>
    <p class="content_text">
      2. ‘회원’은 전 항의 제한된 권리 외에 ‘서비스’를 통하여 제공 받은
      ‘콘텐츠’에 대해 어떠한 권리도 취득하지 않습니다.
    </p>
    <div class="content_text">
      3. ‘회원’은 ‘콘텐츠’를 다음 각 호와 같이 본 조에 의해 허락 받은 범위를
      넘어서서 이용하는 행위를 해서는 안되며, 이와 같은 행위를 할 경우 그에 대한
      모든 민형사상 법적 책임을 집니다.('서비스'의 홍보 목적과 부합시 사용가능
      단, '회사' 이메일로 통보 필요)
      <p class="content_inner_text">
        1. ‘콘텐츠’를 임의로 별도의 동영상 파일 등으로 제작하는 행위
      </p>
      <p class="content_inner_text">
        2. ‘콘텐츠’를 임의로 인터넷에 게시하는 행위
      </p>
      <p class="content_inner_text">
        3. ‘콘텐츠’를 임의로 제3자에게 제공하는 행위
      </p>
      <p class="content_inner_text">
        4. 기타 ‘콘텐츠’에 대한 모든 저작권 침해 행위
      </p>
    </div>
    <p class="content_text">
      4. ‘회원’은 ‘서비스’의 서버와 네트워크 시스템에 허락되지 않은 방식으로
      접근하는 일체의 행위 또는 ‘서비스’의 제공을 방해하는 행위를 해서는
      안됩니다.
    </p>
    <div class="content_text">
      5. ‘회원’은 다음 각 호와 같은 행위를 해서는 안됩니다.
      <p class="content_inner_text">
        1. ‘회사’에 허위정보를 제공하거나 타인의 정보를 도용하는 행위
      </p>
      <p class="content_inner_text">
        2. ‘회사’와 기타 제3자의 저작권 등 지적재산권에 대한 침해 행위
      </p>
      <p class="content_inner_text">
        3. ‘회사’와 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위
      </p>
      <p class="content_inner_text">
        4. ‘회사’의 동의 없이 ‘서비스’를 영리적으로 사용하는 행위
      </p>
      <p class="content_inner_text">
        5. ‘서비스’와 관련하여 ‘회사’를 사칭하거나 허위 정보를 유포하는 행위
      </p>
      <p class="content_inner_text">
        6. 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」(이하
        ‘정보통신망법’) 등 관련법령에서 금지하는 행위 등 기타 불법적이거나
        부당한 행위
      </p>
    </div>
    <p class="content_text">
      6. ‘회원’은 ID와 비밀번호에 대한 관리책임이 있으며, ‘회원’의 고의 또는
      과실로 일어날 수 있는 각종 손해에 대한 책임은 ‘회원’ 본인에게 있으며,
      ‘회원’은 자신의 ID 및 비밀번호를 도난당하거나 제3자가 사용하고 있음을
      인지한 경우에는 즉시 '회사'에 통보하고 안내가 있는 경우에는 그에 따라야
      합니다.
    </p>
    <p class="header_text">
      제8조 (회원콘텐츠 작성/운영정책 및 위반 시 제재의 내용)
    </p>
    <p class="content_text">
      1. ‘회원’이 작성하는 메시지, 게시글, 댓글을 포함하는 모든 콘텐츠(이하,
      ‘회원콘텐츠’라 함)에 대해서는 본 조의 정책이 적용됩니다.
    </p>
    <div class="content_text">
      2. 금지행위: ‘회원’은 아래 각 호의 내용이 포함되는 ‘회원콘텐츠’를
      작성하거나 금지하는 행위를 해서는 안됩니다.
      <p class="content_inner_text">
        1. 타인(‘회사’ 및 ‘회사’ 소속 아티스트 포함)의 명예를 훼손하거나 근거
        없이 비방하는 내용
      </p>
      <p class="content_inner_text">
        2. 욕설, 음란/외설적 내용, 폭력적인 내용 등 사회 상규와 미풍양속에
        반하는 내용
      </p>
      <p class="content_inner_text">
        3. 근거 없이 공포심이나 불안감을 지속적으로 유발하는 내용
      </p>
      <p class="content_inner_text">
        4. 법령에 따라 금지되는 위법 행위와 관련된 내용
      </p>
      <p class="content_inner_text">
        5. 법령에 따라 분류된 영업비밀 또는 국가기밀 등을 누설하는 내용
      </p>
      <p class="content_inner_text">
        6. 범죄를 목적으로 하거나 범죄를 교사 또는 방조하는 내용
      </p>
      <p class="content_inner_text">
        7. 기타 관련 법령에 따라 게시가 금지된 불법적인 내용
      </p>
      <p class="content_inner_text">
        8. 동일/유사한 '회원콘텐츠'를 지속적/반복적으로 게시하는 행위
      </p>
    </div>
    <div class="content_text">
      3. 위반 시 제재의 내용: 위 금지행위를 위반할 경우, 아래 각 호의 내용과
      같은 조치가 취해질 수 있습니다.
      <p class="content_inner_text">
        1. 위반 사유가 확인되었거나 일정 횟수 이상 신고를 받은 ‘회원콘텐츠’는
        자동적으로 임시삭제 조치가 취해지며, 해당 콘텐츠를 작성한 ‘회원’은 해당
        콘텐츠가 제2항의 위반 사유에 해당하지 않음을 소명하여 해당 조치를 해제할
        수 있습니다.
      </p>
      <p>
        2. 위반 사유가 확인되었거나 일정 횟수 이상 신고를 받은 ‘회원’은
        자동적으로 일정한 기간 동안 ‘회원콘텐츠’ 작성이 제한되게 되며, 해당
        ‘회원’은 해당 기간 이내에도 자신이 작성한 콘텐츠가 위반 사유에 해당하지
        않았음을 소명하여 해당 제한조치를 해제할 수 있습니다.
        <br />
        ※ 위 제재의 기준 횟수 및 제재기간은 ‘서비스’의 운영 과정에서 ‘서비스’ 및
        ‘회원’을 부적절한 콘텐츠로부터 보호하기 위한 가장 적절한 횟수로 수시로
        정해지게 됩니다.
      </p>
    </div>
    <p>
      4. 회원이 작성한 ‘회원콘텐츠’에 대한 사용권의 부여: ‘회사’는 필요할 경우
      ‘회원콘텐츠’를 사용할 수 있습니다.
    </p>
    <p class="header_text">제9조 (이용제한)</p>
    <p class="content_text">
      1. ‘회사’는 본 조의 경우, ‘회원’의 ‘서비스’ 이용을 일시적 또는 영구적으로
      제한할 수 있습니다.
    </p>
    <div class="content_text">
      2. 일시적 이용제한

      <p class="content_inner_text">
        1. ‘회원’이 제7조의 회원의 의무를 위반하는 경우
      </p>
      <p class="content_inner_text">
        2. ‘회원’이 제8조의 ‘회원콘텐츠’ 작성/운영정책을 위반하는 경우
      </p>
    </div>
    <div class="content_text">
      3. 영구적 이용제한
      <p class="content_inner_text">
        1. ‘회원’이 제7조의 회원의 의무를 상습적으로 위반하는 경우
      </p>
      <p class="content_inner_text">
        2. ‘회원’의 제7조의 의무위반 행위가 범죄를 구성하는 경우
      </p>
      <p class="content_inner_text">
        3. ‘회원’이 제8조의 ‘회원콘텐츠’ 작성/운영정책을 상습적으로 위반하는
        경우
      </p>
      <p class="content_inner_text">
        4. ‘회원’의 제8조의 ‘회원콘텐츠’ 작성/운영정책의 위반 행위가 범죄를
        구성하는 경우
      </p>
    </div>
    <p class="header_text">제10조 (회사의 권리, 의무 및 면책)</p>
    <p class="content_text">
      1. ‘회사’는 ‘서비스’에 대한 모든 권리를 보유합니다.
    </p>
    <p class="content_text">
      2. ‘회사’는 ‘서비스’를 안정적으로 제공하기 위해 노력하나, 천재지변, 전쟁
      및 기타 이에 준하는 불가항력의 경우, 그리고 제5조의 경우에 ‘서비스’ 제공이
      중지 또는 중단될 수 있으며, 이에 대해서 ‘회사’는 책임을 지지 않습니다.
    </p>
    <p class="content_text">
      3. ‘회사’는 ‘회원’이 ‘콘텐츠’를 이용함으로 인해 발생하는 손해에 대해서
      ‘회사’의 고의 또는 과실 등 귀책이 없는 한 책임지지 않습니다.
    </p>
    <p class="header_text">제11조 (통지)</p>
    <p class="content_text">
      1. ‘회사’가 ‘회원’에게 개별 통지하는 경우 ‘약관’에서 달리 정하지 않는 한
      이메일 주소로 할 수 있습니다.
    </p>
    <p class="content_text">
      2. 제1항에도 불구하고 ‘회사’가 불특정 다수의 ‘회원’에게 통지하는 경우
      ‘서비스’ 화면에 7일 이상 해당 사실을 게시함으로서 개별 통지에 갈음할 수
      있습니다.
    </p>
    <p class="header_text">제12조 (손해배상)</p>
    <p class="content_text">
      1. ‘회사’와 ‘회원’은 각자의 귀책에 의해 상대방에 손해를 끼친 경우, 그에
      대한 손해배상 책임을 집니다. 특히 ‘회원’이 제7조 제3항을 위반하여
      ‘콘텐츠’의 저작권을 침해한 경우, ‘회원’은 그에 대한 모든 민형사상 책임을
      부담합니다.
    </p>
    <p class="header_text">제13조 (서비스 주체의 변경)</p>
    <p class="content_text">
      1. ‘회사’는 영업의 전부 또는 일부의 양도·합병, 인적·물적 분할, 자산 양수도
      등으로 ‘서비스’ 주체가 변경될 경우에는 정보통신망법 제26조에 따라
      개인정보의 이전을 ‘회원’에게 알리도록 합니다.
    </p>
    <p class="content_text">
      2. 제1항에 따른 ‘서비스’ 주체가 변경될 경우 ‘약관’에 따른 ‘회사’와
      ‘회원’이 체결한 ‘이용계약’이 변경되는 ‘서비스’ 주체에게 포괄적으로
      이전됩니다.
    </p>
    <p class="content_text">
      3. ‘회사’는 ‘회원’이 개인정보의 이전과 ‘이용계약’의 이전을 원하지 아니하는
      경우 개인정보 수집 및 이용에 관한 동의와 ‘약관’ 동의를 철회할 수 있는
      방법과 절차를 안내합니다.
    </p>
    <p class="header_text">제14조 (준거법 및 재판 관할)</p>
    <p class="content_text">
      1. 본 약관에 대해서는 대한민국법을 준거법으로 하고, 대한민국 법원이
      관할권을 갖는 것으로 합니다.
    </p>
    <p class="content_text">
      2. ‘회사’와 ‘회원’ 간 발생한 분쟁에 관한 소송은 제소 당시의 회원의 주소에
      의하고, 주소가 없는 경우 거소를 관할하는 지방법원의 전속관할로 합니다. 단,
      제소 당시 회원의 주소 또는 거소가 명확하지 아니한 경우의 관할법원은
      민사소송법에 따라 정합니다. 해외에 주소나 거소가 있는 고객의 경우 회사와
      고객간 발생한 분쟁에 관한 소송은 대한민국 서울중앙지방법원을 관할법원으로
      합니다.
    </p>
    <p class="content_text">적용일 : 2024년 3월 14일</p>
  </div>
</template>

<style scoped>
.wrapper {
  background-color: white;
  color: black;
  display: flex;
  flex-direction: column;
  padding: 20px;
  line-height: 1.5;
}

.root_text {
  font-size: 20px;
  font-weight: bold;
  margin-bottom: 20px;
}

.header_text {
  font-size: 18px;
  font-weight: bold;
  margin-top: 30px;
  margin-bottom: 20px;
}

.content_text {
  font-size: 16px;
  margin-bottom: 10px;
}

.content_inner_text {
  font-size: 16px;
  margin-bottom: 10px;
  margin-left: 20px;
}
</style>
